---
kind: property
id: P:Autodesk.Revit.DB.Document.IsWorkshared
zh: 文档、文件
source: html/7f368167-6543-9be9-67a3-c6e1696ae060.htm
---
# Autodesk.Revit.DB.Document.IsWorkshared Property

**中文**: 文档、文件

Identifies if worksharing (i.e. editing permissions and multiple worksets) have been enabled in the document.
 Also, see IsDetached

## Syntax (C#)
```csharp
public bool IsWorkshared { get; }
```